serving/results/llama_qwen/logs/benchmarks/sandhi__models_qwen2_5_coder_7b_instruct.log

==================================
Running benchmarks (sandhi / qwen)
==================================

==================================
Target: qwen
Port: 12306
Model: /models/Qwen2.5-Coder-7B-Instruct
==================================
RPS=25
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 15:54:40][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 15:54:41 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 15:54:44][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:54:44][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 15:54:47.576000 22339 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 15:54:47.576000 22339 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 15:54:48][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:54:48][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:54:48][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:54:48][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7963ef1bc680>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=25.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 15:54:48 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 573:12:39 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 25.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:32<00:00, 15.50it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Request rate configured (RPS):           25.00     
Benchmark duration (s):                  32.27     
Total input tokens:                      49932     
Total generated tokens:                  450000    
Request throughput (req/s):              15.50     
Output token throughput (tok/s):         13946.66  
Peak output token throughput (tok/s):    16778.00  
Peak concurrent requests:                372.00    
Total Token throughput (tok/s):          15494.18  
---------------Time to First Token----------------
Mean TTFT (ms):                          53.18     
Median TTFT (ms):                        50.53     
P95 TTFT (ms):                           86.91     
P99 TTFT (ms):                           108.71    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.86     
Median TPOT (ms):                        16.97     
P95 TPOT (ms):                           18.78     
P99 TPOT (ms):                           18.80     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.87     
Median ITL (ms):                         16.19     
P95 ITL (ms):                            23.35     
P99 ITL (ms):                            31.84     
==================================================
RPS=30
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 15:55:28][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 15:55:29 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 15:55:33][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:55:33][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 15:55:36.428000 22861 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 15:55:36.428000 22861 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 15:55:37][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:55:37][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:55:37][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:55:37][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x716dc7dc4680>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=30.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 15:55:37 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 613:38:57 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 30.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:31<00:00, 16.05it/s] 
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Request rate configured (RPS):           30.00     
Benchmark duration (s):                  31.16     
Total input tokens:                      49932     
Total generated tokens:                  450000    
Request throughput (req/s):              16.05     
Output token throughput (tok/s):         14443.03  
Peak output token throughput (tok/s):    17228.00  
Peak concurrent requests:                428.00    
Total Token throughput (tok/s):          16045.63  
---------------Time to First Token----------------
Mean TTFT (ms):                          57.41     
Median TTFT (ms):                        52.54     
P95 TTFT (ms):                           106.92    
P99 TTFT (ms):                           125.64    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          18.14     
Median TPOT (ms):                        19.17     
P95 TPOT (ms):                           20.96     
P99 TPOT (ms):                           20.98     
---------------Inter-token Latency----------------
Mean ITL (ms):                           18.15     
Median ITL (ms):                         18.78     
P95 ITL (ms):                            27.42     
P99 ITL (ms):                            37.35     
==================================================
RPS=35
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 15:56:16][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 15:56:17 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 15:56:21][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:56:21][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 15:56:24.218000 23255 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 15:56:24.218000 23255 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 15:56:24][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:56:24][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:56:24][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:56:24][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x770fafb48680>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=35.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 15:56:25 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 587:19:29 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 35.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:30<00:00, 16.14it/s] 
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Request rate configured (RPS):           35.00     
Benchmark duration (s):                  30.99     
Total input tokens:                      49932     
Total generated tokens:                  450000    
Request throughput (req/s):              16.13     
Output token throughput (tok/s):         14521.47  
Peak output token throughput (tok/s):    17693.00  
Peak concurrent requests:                469.00    
Total Token throughput (tok/s):          16132.77  
---------------Time to First Token----------------
Mean TTFT (ms):                          60.52     
Median TTFT (ms):                        56.15     
P95 TTFT (ms):                           107.56    
P99 TTFT (ms):                           144.59    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.40     
Median TPOT (ms):                        21.32     
P95 TPOT (ms):                           23.05     
P99 TPOT (ms):                           23.06     
---------------Inter-token Latency----------------
Mean ITL (ms):                           20.40     
Median ITL (ms):                         21.29     
P95 ITL (ms):                            31.46     
P99 ITL (ms):                            38.84     
==================================================
RPS=40
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 15:57:03][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 15:57:04 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 15:57:08][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:57:08][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 15:57:11.447000 23649 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 15:57:11.447000 23649 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 15:57:12][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:57:12][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:57:12][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 15:57:12][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7b352bd60680>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=40.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 15:57:12 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 578:36:10 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 40.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 500/500 [00:30<00:00, 16.29it/s] 
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Request rate configured (RPS):           40.00     
Benchmark duration (s):                  30.69     
Total input tokens:                      49932     
Total generated tokens:                  450000    
Request throughput (req/s):              16.29     
Output token throughput (tok/s):         14662.18  
Peak output token throughput (tok/s):    17266.00  
Peak concurrent requests:                490.00    
Total Token throughput (tok/s):          16289.10  
---------------Time to First Token----------------
Mean TTFT (ms):                          57.73     
Median TTFT (ms):                        53.95     
P95 TTFT (ms):                           106.40    
P99 TTFT (ms):                           137.42    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.78     
Median TPOT (ms):                        22.64     
P95 TPOT (ms):                           24.15     
P99 TPOT (ms):                           24.16     
---------------Inter-token Latency----------------
Mean ITL (ms):                           21.78     
Median ITL (ms):                         22.59     
P95 ITL (ms):                            32.37     
P99 ITL (ms):                            39.42     
==================================================